<a href="https://colab.research.google.com/github/maciejweber/machine-learning-bootcamp/blob/master/supervised/01_basics/01_preprocessing.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import numpy as np
import pandas as pd
import sklearn

sklearn.__version__

'0.22.2.post1'

In [0]:
data = {'size': ['XL','L','M','L','M'],
        'color': ['red','green','blue','green','red'],
        'gender': ['femele','male','male','femele','femele'],
        'price': [199.0,89.0,99.0,129.0,79.0],
        'weight': [500,450,300,380,410],
        'bought': ['yes','no','yes','no','yes']}

df_raw = pd.DataFrame(data=data)
df_raw

In [8]:
df = df_raw.copy()
df

  size  color  gender  price  weight bought
0   XL    red  femele  199.0     500    yes
1    L  green    male   89.0     450     no
2    M   blue    male   99.0     300    yes
3    L  green  femele  129.0     380     no
4    M    red  femele   79.0     410    yes

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   size    5 non-null      object
 1   color   5 non-null      object
 2   gender  5 non-null      object
 3   price   5 non-null      float64
 4   weight  5 non-null      int64
 5   bought  5 non-null      object
dtypes: float64(1), int64(1), object(4)
memory usage: 368.0+ bytes

In [0]:
for col in ['size','color','gender','bought']:
    df[col] = df[col].astype('category')

In [11]:
df.describe().T

        count   mean        std    min    25%    50%    75%    max
price     5.0  119.0  48.476799   79.0   89.0   99.0  129.0  199.0
weight    5.0  408.0  75.299402  300.0  380.0  410.0  450.0  500.0

In [12]:
df.describe(include=['category']).T

       count unique     top freq
size       5      3       M    2
color      5      3     red    2
gender     5      2  femele    3
bought     5      2     yes    3

In [0]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [14]:
df

  size  color  gender  price  weight bought
0   XL    red  femele  199.0     500    yes
1    L  green    male   89.0     450     no
2    M   blue    male   99.0     300    yes
3    L  green  femele  129.0     380     no
4    M    red  femele   79.0     410    yes

In [15]:
pd.get_dummies(data=df)

   price  weight  size_L  ...  gender_male  bought_no  bought_yes
0  199.0     500       0  ...            0          0           1
1   89.0     450       1  ...            1          1           0
2   99.0     300       0  ...            1          0           1
3  129.0     380       1  ...            0          1           0
4   79.0     410       0  ...            0          0           1

[5 rows x 12 columns]

In [16]:
pd.get_dummies(data=df, drop_first=True)

   price  weight  size_M  ...  color_red  gender_male  bought_yes
0  199.0     500       0  ...          1            0           1
1   89.0     450       0  ...          0            1           0
2   99.0     300       1  ...          0            1           1
3  129.0     380       0  ...          0            0           0
4   79.0     410       1  ...          1            0           1

[5 rows x 8 columns]

In [17]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
scaler.fit(df[['price']])
scaler.transform(df[['price']])

array([[ 1.84506242],
       [-0.69189841],
       [-0.4612656 ],
       [ 0.2306328 ],
       [-0.92253121]])

In [18]:
from sklearn.preprocessing import StandardScaler

df[['price','weight']] = scaler.fit_transform(df[['price','weight']])
df

  size  color  gender     price    weight bought
0   XL    red  femele  1.845062  1.366002    yes
1    L  green    male -0.691898  0.623610     no
2    M   blue    male -0.461266 -1.603567    yes
3    L  green  femele  0.230633 -0.415740     no
4    M    red  femele -0.922531  0.029696    yes

In [19]:
df = df_raw.copy()
df

  size  color  gender  price  weight bought
0   XL    red  femele  199.0     500    yes
1    L  green    male   89.0     450     no
2    M   blue    male   99.0     300    yes
3    L  green  femele  129.0     380     no
4    M    red  femele   79.0     410    yes

In [20]:
le = LabelEncoder()

df['bought'] = le.fit_transform(df['bought'])

scaler = StandardScaler()
df[['price', 'weight']] = scaler.fit_transform(df[['price','weight']])

df = pd.get_dummies(data=df, drop_first=True)
df

      price    weight  bought  ...  color_green  color_red  gender_male
0  1.845062  1.366002       1  ...            0          1            0
1 -0.691898  0.623610       0  ...            1          0            1
2 -0.461266 -1.603567       1  ...            0          0            1
3  0.230633 -0.415740       0  ...            1          0            0
4 -0.922531  0.029696       1  ...            0          1            0

[5 rows x 8 columns]